fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ВКМ_УведомленияТелеграмБоту/ВКМ_УведомленияТелеграмБоту.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_УведомленияТелеграмБоту</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.ВКМ_ОбслуживаниеКлиента</types>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		НикСотрудника = ПолучитьНикСотрудника(Объект.Сотрудник);
		
		ТекстСообщения = СтрШаблон("Заказ №%1 от %2
									 |Клиент: %3
									 |Дата: %4
									 |Время начала: %5
									 |Время окончания: %6
									 |Специалист: %7
									 |Описание: %8
									 |@%9",
									 Объект.Номер, 
									 Объект.Дата, 
									 Объект.Клиент, 
									 Формат(Объект.ДатаПроведенияРабот, "ДЛФ=DD;"), 
									 Формат(Объект.ВремяНачалаРабот, "ДФ=HH:mm;"), 
									 Формат(Объект.ВремяОкончанияРабот, "ДФ=HH:mm;"), 
									 Объект.Сотрудник,
									 Объект.ОписаниеПроблемы,
									 НикСотрудника);
		
		Если Объект.НовыйДокумент Тогда
			
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "Новый заказ №");
			Объект.НовыйДокумент = Ложь;
			
		Иначе
			
			Если Объект.Сотрудник <> СотрудникИзм Тогда
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №", "ИЗМЕНЕН заказ №");
				ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("-Специалист изменен с %1 на %2", 
																			СотрудникИзм, Объект.Сотрудник); 
			КонецЕсли;
			
			Если Объект.ДатаПроведенияРабот <> ДатаПроведенияРаботИзм Тогда
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №%1 от %2", "ИЗМЕНЕН заказ №%1 от %2");
				ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("-Дата изменена с %1 на %2", 
																			Формат(ДатаПроведенияРаботИзм, "ДЛФ=DD;"), 
																			Формат(Объект.ДатаПроведенияРабот, "ДЛФ=DD;")); 
			КонецЕсли;
			
			Если Объект.ВремяНачалаРабот <> ВремяНачалаРаботИзм ИЛИ Объект.ВремяОкончанияРабот <> ВремяОкончанияРаботИзм Тогда
				ТекстСообщения = СтрЗаменить(ТекстСообщения, "Заказ №%1 от %2", "ИЗМЕНЕН заказ №%1 от %2");
				//ТекстСообщения = ТекстСообщения + Символы.ПС + "Время начала изменено с " + Формат(ВремяНачалаРаботИзм, "ДФ=HH:mm;") + " на " + Формат(Объект.ВремяНачалаРабот, "ДФ=HH:mm;");
				ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон("-Время проведения работ изменено с %1-%2 на %3-%4", 
																			Формат(ВремяНачалаРаботИзм, "ДФ=HH:mm;"),
																			Формат(ВремяОкончанияРаботИзм, "ДФ=HH:mm;"),
																			Формат(Объект.ВремяНачалаРабот, "ДФ=HH:mm;"),
																			Формат(Объект.ВремяОкончанияРабот, "ДФ=HH:mm;"));
			КонецЕсли;
			
		КонецЕсли;	
			
		СоздатьСообщениеДляОтправки(ТекстСообщения, Объект.Ссылка);
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	Если Объект.Ссылка.Пустая() Тогда
		Объект.НовыйДокумент = Истина;
	КонецЕсли;
	
	Если НЕ Объект.НовыйДокумент Тогда
		ДатаПроведенияРаботИзм = Объект.ДатаПроведенияРабот;
		ВремяНачалаРаботИзм = Объект.ВремяНачалаРабот;
		ВремяОкончанияРаботИзм = Объект.ВремяОкончанияРабот;
		СотрудникИзм = Объект.Сотрудник;
	КонецЕсли;

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте 
Процедура Подключаемый_ВыполнитьКоманду(Команда)
          ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
          ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
          ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура СоздатьСообщениеДляОтправки(ТекстСообщения, Источник)
	СообщениеБота = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	СообщениеБота.ТекстСообщения = ТекстСообщения;
	СообщениеБота.ДокументИсточник = Источник;
	СообщениеБота.Записать();
КонецПроцедуры

&НаСервере
Функция ПолучитьНикСотрудника(Сотрудник)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_Сотрудники.НикВТелеграмм КАК НикВТелеграмм
		|ИЗ
		|	Справочник.ВКМ_Сотрудники КАК ВКМ_Сотрудники
		|ГДЕ
		|	ВКМ_Сотрудники.Ссылка = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.НикВТелеграмм;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции
#КонецОбласти
